sorosaulong-ux/gd32-test-project/Library/gd32a7xx_trigsel.c
      \arg        TRIGSEL_INPUT_TIMER2_CH1: trigger input source TIMER2 CH1 output
      \arg        TRIGSEL_INPUT_TIMER2_CH2: trigger input source TIMER2 CH2 output
      \arg        TRIGSEL_INPUT_TIMER2_CH3: trigger input source TIMER2 CH3 output
      \arg        TRIGSEL_INPUT_TIMER5_TRGO0: trigger input source TIMER5 TRGO0 output
      \arg        TRIGSEL_INPUT_TIMER5_TRGO1: trigger input source TIMER5 TRGO1 output
      \arg        TRIGSEL_INPUT_TIMER5_TRGO2: trigger input source TIMER5 TRGO2 output
      \arg        TRIGSEL_INPUT_TIMER5_TRGO3: trigger input source TIMER5 TRGO3 output
      \arg        TRIGSEL_INPUT_TIMER6_TRGO0: trigger input source TIMER6 TRGO0 output
      \arg        TRIGSEL_INPUT_TIMER6_TRGO1: trigger input source TIMER6 TRGO1 output
      \arg        TRIGSEL_INPUT_TIMER6_TRGO2: trigger input source TIMER6 TRGO2 output
      \arg        TRIGSEL_INPUT_TIMER6_TRGO3: trigger input source TIMER6 TRGO3 output
      \arg        TRIGSEL_INPUT_CMP0_OUT: trigger input source CMP0 output
      \arg        TRIGSEL_INPUT_CMP1_OUT: trigger input source CMP1 output
      \arg        TRIGSEL_INPUT_BKP_TAMPER: trigger input source BKP tamper interrupt flag
      \arg        TRIGSEL_INPUT_RTC_ALARM: trigger input source RTC alarm output
      \arg        TRIGSEL_INPUT_MFCOM_TIMER0_OUT: trigger input source MFCOM TIMER0 output only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_MFCOM_TIMER1_OUT: trigger input source MFCOM TIMER1 output only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_MFCOM_TIMER2_OUT: trigger input source MFCOM TIMER2 output only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_MFCOM_TIMER3_OUT: trigger input source MFCOM TIMER3 output only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_CM7_0_TXEV : trigger input source CM7_0_TXEV
      \arg        TRIGSEL_INPUT_CM7_1_TXEV : trigger input source CM7_1_TXEV only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_CK_OUT0: trigger input source CK_OUT0
      \arg        TRIGSEL_INPUT_TIMER_ETI0 : trigger input source TIMER_ETI0 pin
      \arg        TRIGSEL_INPUT_TIMER_ETI1 : trigger input source TIMER_ETI1 pin
      \arg        TRIGSEL_INPUT_TIMER_ETI2 : trigger input source TIMER_ETI2 pin
      \arg        TRIGSEL_INPUT_CK_OUT1: trigger input source CK_OUT1
      \arg        TRIGSEL_INPUT_DAC0_EOC: trigger input source DAC0_eoc
      \arg        TRIGSEL_INPUT_DAC1_EOC: trigger input source DAC1_eoc
      \arg        TRIGSEL_INPUT_ADC0_EORC: trigger input source end of ADC0 routine sequence conversion
      \arg        TRIGSEL_INPUT_ADC1_EORC: trigger input source end of ADC1 routine sequence conversion
      \arg        TRIGSEL_INPUT_ADC2_EORC  : trigger input source end of ADC2 routine sequence conversion only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_ADC0_ECH: trigger input source end of ADC0 routine/inserted sequence channel conversion
      \arg        TRIGSEL_INPUT_ADC1_ECH: trigger input source end of ADC1 routine/inserted sequence channel conversion
      \arg        TRIGSEL_INPUT_ADC2_ECH: trigger input source end of ADC2 routine/inserted sequence channel conversion only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_ADC0_WD0_OUT: trigger input source ADC0 analog watchdog0 output
      \arg        TRIGSEL_INPUT_ADC0_WD1_OUT: trigger input source ADC0 analog watchdog1 output
      \arg        TRIGSEL_INPUT_ADC0_WD2_OUT: trigger input source ADC0 analog watchdog2 output
      \arg        TRIGSEL_INPUT_ADC0_WD3_OUT: trigger input source ADC0 analog watchdog3 output
      \arg        TRIGSEL_INPUT_ADC1_WD0_OUT: trigger input source ADC1 analog watchdog0 output
      \arg        TRIGSEL_INPUT_ADC1_WD1_OUT: trigger input source ADC1 analog watchdog1 output
      \arg        TRIGSEL_INPUT_ADC1_WD2_OUT: trigger input source ADC1 analog watchdog2 output
      \arg        TRIGSEL_INPUT_ADC1_WD3_OUT: trigger input source ADC1 analog watchdog3 output
      \arg        TRIGSEL_INPUT_ADC2_WD0_OUT: trigger input source ADC2 analog watchdog0 output only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_ADC2_WD1_OUT: trigger input source ADC2 analog watchdog1 output only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_ADC2_WD2_OUT: trigger input source ADC2 analog watchdog2 output only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_ADC2_WD3_OUT: trigger input source ADC2 analog watchdog3 output only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_ADC0_EOI0C: trigger input source end of ADC0 inserted sequence 0 conversion
      \arg        TRIGSEL_INPUT_ADC0_EOI1C: trigger input source end of ADC0 inserted sequence 1 conversion
      \arg        TRIGSEL_INPUT_ADC0_EOI2C: trigger input source end of ADC0 inserted sequence 2 conversion
      \arg        TRIGSEL_INPUT_ADC0_EOI3C: trigger input source end of ADC0 inserted sequence 3 conversion
      \arg        TRIGSEL_INPUT_ADC0_EOI4C: trigger input source end of ADC0 inserted sequence 4 conversion
      \arg        TRIGSEL_INPUT_ADC0_EOI5C: trigger input source end of ADC0 inserted sequence 5 conversion
      \arg        TRIGSEL_INPUT_ADC1_EOI0C: trigger input source end of ADC1 inserted sequence 0 conversion
      \arg        TRIGSEL_INPUT_ADC1_EOI1C: trigger input source end of ADC1 inserted sequence 1 conversion
      \arg        TRIGSEL_INPUT_ADC1_EOI2C: trigger input source end of ADC1 inserted sequence 2 conversion
      \arg        TRIGSEL_INPUT_ADC1_EOI3C: trigger input source end of ADC1 inserted sequence 3 conversion
      \arg        TRIGSEL_INPUT_ADC1_EOI4C: trigger input source end of ADC1 inserted sequence 4 conversion
      \arg        TRIGSEL_INPUT_ADC1_EOI5C: trigger input source end of ADC1 inserted sequence 5 conversion
      \arg        TRIGSEL_INPUT_ADC2_EOI0C: trigger input source end of ADC2 inserted sequence 0 conversion only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_ADC2_EOI1C: trigger input source end of ADC2 inserted sequence 1 conversion only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_ADC2_EOI2C: trigger input source end of ADC2 inserted sequence 2 conversion only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_ADC2_EOI3C: trigger input source end of ADC2 inserted sequence 3 conversion only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_ADC2_EOI4C: trigger input source end of ADC2 inserted sequence 4 conversion only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_ADC2_EOI5C: trigger input source end of ADC2 inserted sequence 5 conversion only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER0_TRGO0_IOC: trigger input source TIMER0 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER7_TRGO0_IOC: trigger input source TIMER7 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER19_TRGO0_IOC: trigger input source TIMER19 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER20_TRGO0_IOC: trigger input source TIMER20 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER60_TRGO0_IOC: trigger input source TIMER60 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER61_TRGO0_IOC: trigger input source TIMER61 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER62_TRGO0_IOC: trigger input source TIMER62 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER63_TRGO0_IOC: trigger input source TIMER63 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER1_TRGO0_IOC: trigger input source TIMER1 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER2_TRGO0_IOC: trigger input source TIMER2 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER5_TRGO0_IOC: trigger input source TIMER5 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER5_TRGO1_IOC: trigger input source TIMER5 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER5_TRGO2_IOC: trigger input source TIMER5 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER5_TRGO3_IOC: trigger input source TIMER5 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER6_TRGO0_IOC: trigger input source TIMER6 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER6_TRGO1_IOC: trigger input source TIMER6 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER6_TRGO2_IOC: trigger input source TIMER6 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_INPUT_TIMER6_TRGO3_IOC: trigger input source TIMER6 TRGO0 signal to IOC only available in GD32A72x and GD32A74x
    \param[out] none
    \retval     none
*/
void trigsel_init(trigsel_periph_enum target_periph, trigsel_source_enum trigger_source)
{
    /* if register write is enabled, set trigger source to target peripheral */
    if (RESET == trigsel_register_lock_get(target_periph)){
        TRIGSEL_TARGET_REG(target_periph) &= ~TRIGSEL_TARGET_PERIPH_MASK(target_periph);
        TRIGSEL_TARGET_REG(target_periph) |= ((uint32_t)trigger_source << TRIGSEL_TARGET_PERIPH_SHIFT(target_periph)) & TRIGSEL_TARGET_PERIPH_MASK(target_periph);
    }
    
