sorosaulong-ux/gd32-test-project/Library/gd32a7xx_trigsel.c
}

/*!
    \brief      get the trigger input signal for target peripheral
    \param[in]  target_periph: target peripheral value
                only one parameter can be selected which is shown as below:
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT0: output target peripheral TRIGSEL_OUT0 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT1: output target peripheral TRIGSEL_OUT1 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT2: output target peripheral TRIGSEL_OUT2 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT3: output target peripheral TRIGSEL_OUT3 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT4: output target peripheral TRIGSEL_OUT4 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT5: output target peripheral TRIGSEL_OUT5 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT6: output target peripheral TRIGSEL_OUT6 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT7: output target peripheral TRIGSEL_OUT7 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT8: output target peripheral TRIGSEL_OUT8 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT9: output target peripheral TRIGSEL_OUT9 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT10: output target peripheral TRIGSEL_OUT10 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT11: output target peripheral TRIGSEL_OUT11 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT12: output target peripheral TRIGSEL_OUT12 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT13: output target peripheral TRIGSEL_OUT13 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT14: output target peripheral TRIGSEL_OUT14 pin
      \arg        TRIGSEL_OUTPUT_TRIGSEL_OUT15: output target peripheral TRIGSEL_OUT15 pin
      \arg        TRIGSEL_OUTPUT_IOC_MONITOR0: output target peripheral IOC monitor0 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_MONITOR1: output target peripheral IOC monitor1 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_MONITOR2: output target peripheral IOC monitor2 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_MONITOR3: output target peripheral IOC monitor3 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_MONITOR4: output target peripheral IOC monitor4 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_MONITOR5: output target peripheral IOC monitor5 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_MONITOR6: output target peripheral IOC monitor6 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_MONITOR7: output target peripheral IOC monitor7 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_REFERENCE0: output target peripheral IOC reference0 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_REFERENCE1: output target peripheral IOC reference1 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_REFERENCE2: output target peripheral IOC reference2 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_REFERENCE3: output target peripheral IOC reference3 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_REFERENCE4: output target peripheral IOC reference4 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_REFERENCE5: output target peripheral IOC reference5 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_REFERENCE6: output target peripheral IOC reference6 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_IOC_REFERENCE7: output target peripheral IOC reference7 signal only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_CAN0_EX_TIME_TICK: output target peripheral CAN0_EX_TIME_TICK
      \arg        TRIGSEL_OUTPUT_CAN1_EX_TIME_TICK: output target peripheral CAN1_EX_TIME_TICK
      \arg        TRIGSEL_OUTPUT_CAN2_EX_TIME_TICK: output target peripheral CAN2_EX_TIME_TICK
      \arg        TRIGSEL_OUTPUT_CAN3_EX_TIME_TICK: output target peripheral CAN3_EX_TIME_TICK
      \arg        TRIGSEL_OUTPUT_CAN4_EX_TIME_TICK: output target peripheral CAN4_EX_TIME_TICK
      \arg        TRIGSEL_OUTPUT_CAN5_EX_TIME_TICK: output target peripheral CAN5_EX_TIME_TICK
      \arg        TRIGSEL_OUTPUT_CAN6_EX_TIME_TICK: output target peripheral CAN6_EX_TIME_TICK only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_CAN7_EX_TIME_TICK: output target peripheral CAN7_EX_TIME_TICK only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_TIMER0_ITI0: output target peripheral TIMER0_ITI0
      \arg        TRIGSEL_OUTPUT_TIMER1_ITI0: output target peripheral TIMER1_ITI0
      \arg        TRIGSEL_OUTPUT_TIMER2_ITI0: output target peripheral TIMER2_ITI0
      \arg        TRIGSEL_OUTPUT_TIMER7_ITI0: output target peripheral TIMER7_ITI0
      \arg        TRIGSEL_OUTPUT_TIMER19_ITI0: output target peripheral TIMER19_ITI0
      \arg        TRIGSEL_OUTPUT_TIMER20_ITI0: output target peripheral TIMER20_ITI0
      \arg        TRIGSEL_OUTPUT_TIMER60_ITI0: output target peripheral TIMER60_ITI0
      \arg        TRIGSEL_OUTPUT_TIMER61_ITI0: output target peripheral TIMER61_ITI0
      \arg        TRIGSEL_OUTPUT_TIMER62_ITI0: output target peripheral TIMER62_ITI0
      \arg        TRIGSEL_OUTPUT_TIMER63_ITI0: output target peripheral TIMER63_ITI0
      \arg        TRIGSEL_OUTPUT_TIMER0_BRKIN0: output target peripheral TIMER0_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER0_BRKIN1: output target peripheral TIMER0_BRKIN1
      \arg        TRIGSEL_OUTPUT_TIMER0_BRKIN2: output target peripheral TIMER0_BRKIN2
      \arg        TRIGSEL_OUTPUT_TIMER0_BRKIN3: output target peripheral TIMER0_BRKIN3
      \arg        TRIGSEL_OUTPUT_TIMER7_BRKIN0: output target peripheral TIMER7_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER7_BRKIN1: output target peripheral TIMER7_BRKIN1
      \arg        TRIGSEL_OUTPUT_TIMER7_BRKIN2: output target peripheral TIMER7_BRKIN2
      \arg        TRIGSEL_OUTPUT_TIMER7_BRKIN3: output target peripheral TIMER7_BRKIN3
      \arg        TRIGSEL_OUTPUT_TIMER19_BRKIN0: output target peripheral TIMER19_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER19_BRKIN1: output target peripheral TIMER19_BRKIN1
      \arg        TRIGSEL_OUTPUT_TIMER19_BRKIN2: output target peripheral TIMER19_BRKIN2
      \arg        TRIGSEL_OUTPUT_TIMER19_BRKIN3: output target peripheral TIMER19_BRKIN3
      \arg        TRIGSEL_OUTPUT_TIMER20_BRKIN0: output target peripheral TIMER20_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER20_BRKIN1: output target peripheral TIMER20_BRKIN1
      \arg        TRIGSEL_OUTPUT_TIMER20_BRKIN2: output target peripheral TIMER20_BRKIN2
      \arg        TRIGSEL_OUTPUT_TIMER20_BRKIN3: output target peripheral TIMER20_BRKIN3
      \arg        TRIGSEL_OUTPUT_TIMER60_BRKIN0: output target peripheral TIMER60_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER60_BRKIN1: output target peripheral TIMER60_BRKIN1
      \arg        TRIGSEL_OUTPUT_TIMER60_BRKIN2: output target peripheral TIMER60_BRKIN2
      \arg        TRIGSEL_OUTPUT_TIMER60_BRKIN3: output target peripheral TIMER60_BRKIN3
      \arg        TRIGSEL_OUTPUT_TIMER61_BRKIN0: output target peripheral TIMER61_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER61_BRKIN1: output target peripheral TIMER61_BRKIN1
      \arg        TRIGSEL_OUTPUT_TIMER61_BRKIN2: output target peripheral TIMER61_BRKIN2
      \arg        TRIGSEL_OUTPUT_TIMER61_BRKIN3: output target peripheral TIMER61_BRKIN3
      \arg        TRIGSEL_OUTPUT_TIMER62_BRKIN0: output target peripheral TIMER62_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER62_BRKIN1: output target peripheral TIMER62_BRKIN1
      \arg        TRIGSEL_OUTPUT_TIMER62_BRKIN2: output target peripheral TIMER62_BRKIN2
      \arg        TRIGSEL_OUTPUT_TIMER62_BRKIN3: output target peripheral TIMER62_BRKIN3
      \arg        TRIGSEL_OUTPUT_TIMER63_BRKIN0: output target peripheral TIMER63_BRKIN0
      \arg        TRIGSEL_OUTPUT_TIMER63_BRKIN1: output target peripheral TIMER63_BRKIN1
      \arg        TRIGSEL_OUTPUT_TIMER63_BRKIN2: output target peripheral TIMER63_BRKIN2
      \arg        TRIGSEL_OUTPUT_TIMER63_BRKIN3: output target peripheral TIMER63_BRKIN3
      \arg        TRIGSEL_OUTPUT_MFCOM_TRIG0: output target peripheral MFCOM external trigger 0 only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_MFCOM_TRIG1: output target peripheral MFCOM external trigger 1 only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_MFCOM_TRIG2: output target peripheral MFCOM external trigger 2 only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_MFCOM_TRIG3: output target peripheral MFCOM external trigger 3 only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_CM7_0_RXEV: output target peripheral CM7_0_RXEV
      \arg        TRIGSEL_OUTPUT_CM7_1_RXEV: output target peripheral CM7_1_RXEV
      \arg        TRIGSEL_OUTPUT_DAC0_OUT0_EXTRG: output target peripheral DAC0_OUT0 external trigger
      \arg        TRIGSEL_OUTPUT_DAC1_OUT0_EXTRG: output target peripheral DAC1_OUT0 external trigger
      \arg        TRIGSEL_OUTPUT_ADC0_ROUTRG : output target peripheral ADC0 routine sequence external trigger
      \arg        TRIGSEL_OUTPUT_ADC0_INS0TRG: output target peripheral ADC0 inserted sequence 0 external trigger
      \arg        TRIGSEL_OUTPUT_ADC0_INS1TRG: output target peripheral ADC0 inserted sequence 1 external trigger
      \arg        TRIGSEL_OUTPUT_ADC0_INS2TRG: output target peripheral ADC0 inserted sequence 2 external trigger
      \arg        TRIGSEL_OUTPUT_ADC0_INS3TRG: output target peripheral ADC0 inserted sequence 3 external trigger
      \arg        TRIGSEL_OUTPUT_ADC0_INS4TRG: output target peripheral ADC0 inserted sequence 4 external trigger
      \arg        TRIGSEL_OUTPUT_ADC0_INS5TRG: output target peripheral ADC0 inserted sequence 5 external trigger
      \arg        TRIGSEL_OUTPUT_ADC1_ROUTRG : output target peripheral ADC1 routine sequence external trigger 
      \arg        TRIGSEL_OUTPUT_ADC1_INS0TRG: output target peripheral ADC1 inserted sequence 0 external trigger
      \arg        TRIGSEL_OUTPUT_ADC1_INS1TRG: output target peripheral ADC1 inserted sequence 1 external trigger
      \arg        TRIGSEL_OUTPUT_ADC1_INS2TRG: output target peripheral ADC1 inserted sequence 2 external trigger
      \arg        TRIGSEL_OUTPUT_ADC1_INS3TRG: output target peripheral ADC1 inserted sequence 3 external trigger
      \arg        TRIGSEL_OUTPUT_ADC1_INS4TRG: output target peripheral ADC1 inserted sequence 4 external trigger
      \arg        TRIGSEL_OUTPUT_ADC1_INS5TRG: output target peripheral ADC1 inserted sequence 5 external trigger
      \arg        TRIGSEL_OUTPUT_ADC2_ROUTRG : output target peripheral ADC2 routine sequence external trigger only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_ADC2_INS0TRG: output target peripheral ADC2 inserted sequence 0 external trigger only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_ADC2_INS1TRG: output target peripheral ADC2 inserted sequence 1 external trigger only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_ADC2_INS2TRG: output target peripheral ADC2 inserted sequence 2 external trigger only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_ADC2_INS3TRG: output target peripheral ADC2 inserted sequence 3 external trigger only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_ADC2_INS4TRG: output target peripheral ADC2 inserted sequence 4 external trigger only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_ADC2_INS5TRG: output target peripheral ADC2 inserted sequence 5 external trigger only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_SPI0_TRIG: output target peripheral SPI0 trigger
      \arg        TRIGSEL_OUTPUT_SPI1_TRIG: output target peripheral SPI1 trigger
      \arg        TRIGSEL_OUTPUT_SPI2_TRIG: output target peripheral SPI2 trigger
      \arg        TRIGSEL_OUTPUT_SPI3_TRIG: output target peripheral SPI3 trigger
      \arg        TRIGSEL_OUTPUT_SPI4_TRIG: output target peripheral SPI4 trigger
      \arg        TRIGSEL_OUTPUT_SPI5_TRIG: output target peripheral SPI5 trigger
      \arg        TRIGSEL_OUTPUT_SPI6_TRIG: output target peripheral SPI6 trigger only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_SPI7_TRIG: output target peripheral SPI7 trigger only available in GD32A72x and GD32A74x
      \arg        TRIGSEL_OUTPUT_TIMER_ETI0: output target peripheral TIMER_ETI0
      \arg        TRIGSEL_OUTPUT_TIMER_ETI1: output target peripheral TIMER_ETI1
      \arg        TRIGSEL_OUTPUT_TIMER_ETI2: output target peripheral TIMER_ETI2
      \arg        TRIGSEL_OUTPUT_LINFLEXD0_TRIG: output target peripheral LINFlexD0 trigger
      \arg        TRIGSEL_OUTPUT_LINFLEXD1_TRIG: output target peripheral LINFlexD1 trigger
      \arg        TRIGSEL_OUTPUT_LINFLEXD2_TRIG: output target peripheral LINFlexD2 trigger
      \arg        TRIGSEL_OUTPUT_LINFLEXD3_TRIG: output target peripheral LINFlexD3 trigger
      \arg        TRIGSEL_OUTPUT_LINFLEXD4_TRIG: output target peripheral LINFlexD4 trigger
      \arg        TRIGSEL_OUTPUT_LINFLEXD5_TRIG: output target peripheral LINFlexD5 trigger
    \param[out] none
    \retval  trigger_source: trigger source value(0~218)
*/
trigsel_source_enum trigsel_trigger_source_get(trigsel_periph_enum target_periph)
{
    trigsel_source_enum trigger_source;
    uint32_t trigger_sourcetemp;

